{"modelTopology": {"keras_version": "2.2.4", "model_config": {"config": {"layers": [{"config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 16, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "depthwise_conv2d_1"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_2"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_3"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "depthwise_conv2d_2"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]], "name": "batch_normalization_4"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_5"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "depthwise_conv2d_3"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]], "name": "batch_normalization_6"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 128, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_7"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "depthwise_conv2d_4"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_4", 0, 0, {}]]], "name": "batch_normalization_8"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 256, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_9"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "depthwise_conv2d_5"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_5", 0, 0, {}]]], "name": "batch_normalization_10"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "leaky_re_lu_6"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 512, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_11"}, {"config": {"trainable": true, "strides": [1, 1], "name": "max_pooling2d_6", "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "depthwise_conv2d_6"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_12", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_6", 0, 0, {}]]], "name": "batch_normalization_12"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "leaky_re_lu_7"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 1024, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_13", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_13"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 256, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "conv2d_8"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_14", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_14"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_8"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "leaky_re_lu_8"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 128, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "conv2d_11"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_17", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_17"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_10"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "leaky_re_lu_10"}, {"config": {"trainable": true, "size": [2, 2], "interpolation": "nearest", "data_format": "channels_last", "name": "up_sampling2d_1"}, "class_name": "UpSampling2D", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "concatenate_1"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "depthwise_conv2d_7"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "depthwise_conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "depthwise_conv2d_8"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_15", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_7", 0, 0, {}]]], "name": "batch_normalization_15"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_18", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["depthwise_conv2d_8", 0, 0, {}]]], "name": "batch_normalization_18"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_9"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "leaky_re_lu_9"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_11"}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "leaky_re_lu_11"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 512, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "conv2d_9"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "filters": 256, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "conv2d_12"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_16", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_16"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_19", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_19"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "filters": 18, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "conv2d_10"}, {"config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "filters": 18, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_13", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "conv2d_13"}], "output_layers": [["conv2d_10", 0, 0], ["conv2d_13", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_17/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "batch_normalization_19/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [1, 1, 512, 18], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [18], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [1, 1, 384, 256], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [1, 1, 256, 18], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [18], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "depthwise_conv2d_1/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_3/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_6/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_7/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "depthwise_conv2d_8/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}]}]}