{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "depthwise_conv2d_1", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "depthwise_conv2d_2", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_2", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "depthwise_conv2d_3", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "depthwise_conv2d_4", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_4", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "depthwise_conv2d_5", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"name": "depthwise_conv2d_6", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_6", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "depthwise_conv2d_7", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depthwise_conv2d_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 18, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 18, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_10", 0, 0], ["conv2d_13", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 0.47126373648643494, "scale": 0.003728121986576155, "dtype": "uint8"}}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.9031672078020433, "scale": 0.009311002142289106, "dtype": "uint8"}}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -1.9581998189290364, "scale": 0.0230376449285769, "dtype": "uint8"}}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 0.041149552911520004, "scale": 0.022353907440807307, "dtype": "uint8"}}, {"name": "batch_normalization_10/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.3402383327484131, "scale": 0.0124296833487118, "dtype": "uint8"}}, {"name": "batch_normalization_10/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.9442448342547697, "scale": 0.006696771874147303, "dtype": "uint8"}}, {"name": "batch_normalization_10/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -4.10832399854473, "scale": 0.0320962812386307, "dtype": "uint8"}}, {"name": "batch_normalization_10/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 1.789745807647705, "scale": 0.02262302286484662, "dtype": "uint8"}}, {"name": "batch_normalization_11/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.6932935118675232, "scale": 0.004011140851413502, "dtype": "uint8"}}, {"name": "batch_normalization_11/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.9107240564682905, "scale": 0.00813146478989545, "dtype": "uint8"}}, {"name": "batch_normalization_11/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -5.167832094080308, "scale": 0.028710178300446153, "dtype": "uint8"}}, {"name": "batch_normalization_11/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.1428968608379364, "scale": 0.10928333425054364, "dtype": "uint8"}}, {"name": "batch_normalization_12/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.534856915473938, "scale": 0.004460672303742054, "dtype": "uint8"}}, {"name": "batch_normalization_12/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.006005394290767464, "scale": 4.922454336694642e-05, "dtype": "uint8"}}, {"name": "batch_normalization_12/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -4.869388886994006, "scale": 0.04126600751689836, "dtype": "uint8"}}, {"name": "batch_normalization_12/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 3.2432637214660645, "scale": 0.05286532196344114, "dtype": "uint8"}}, {"name": "batch_normalization_13/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.32075732946395874, "scale": 0.004922726808809766, "dtype": "uint8"}}, {"name": "batch_normalization_13/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.4964180224082049, "scale": 0.005705954280554079, "dtype": "uint8"}}, {"name": "batch_normalization_13/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -0.03707773884137471, "scale": 0.00032812158266703285, "dtype": "uint8"}}, {"name": "batch_normalization_13/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 96.18222045898438, "scale": 0.9552456724877451, "dtype": "uint8"}}, {"name": "batch_normalization_14/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.42525169253349304, "scale": 0.00428583493419722, "dtype": "uint8"}}, {"name": "batch_normalization_14/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.08262404209258509, "scale": 0.005901717292327507, "dtype": "uint8"}}, {"name": "batch_normalization_14/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -2.4099132299423216, "scale": 0.015751066862368115, "dtype": "uint8"}}, {"name": "batch_normalization_14/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.3709885776042938, "scale": 0.03300705435229283, "dtype": "uint8"}}, {"name": "batch_normalization_15/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.008671668358147144, "scale": 0.003537311167547516, "dtype": "uint8"}}, {"name": "batch_normalization_15/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.8797641384835336, "scale": 0.007455628292233336, "dtype": "uint8"}}, {"name": "batch_normalization_15/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -3.703812036327287, "scale": 0.026646129757750266, "dtype": "uint8"}}, {"name": "batch_normalization_15/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 1.5984724760055542, "scale": 0.1452772855758667, "dtype": "uint8"}}, {"name": "batch_normalization_16/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.5586680769920349, "scale": 0.006487630629072002, "dtype": "uint8"}}, {"name": "batch_normalization_16/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.8021070241928101, "scale": 0.005242529569887648, "dtype": "uint8"}}, {"name": "batch_normalization_16/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -4.658450771780575, "scale": 0.034507042753930184, "dtype": "uint8"}}, {"name": "batch_normalization_16/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 2.5210390090942383, "scale": 0.08995688569312002, "dtype": "uint8"}}, {"name": "batch_normalization_17/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0007843234925530851, "scale": 0.009287047207437674, "dtype": "uint8"}}, {"name": "batch_normalization_17/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -1.3226472279604744, "scale": 0.010581177823683795, "dtype": "uint8"}}, {"name": "batch_normalization_17/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.9121210434857536, "scale": 0.018787877699908088, "dtype": "uint8"}}, {"name": "batch_normalization_17/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.1191631481051445, "scale": 0.09340626728885314, "dtype": "uint8"}}, {"name": "batch_normalization_18/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": -0.026849625880519548, "scale": 0.0038356608400742214, "dtype": "uint8"}}, {"name": "batch_normalization_18/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.9692294889805364, "scale": 0.008428082512874229, "dtype": "uint8"}}, {"name": "batch_normalization_18/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -8.61667932248583, "scale": 0.06893343457988664, "dtype": "uint8"}}, {"name": "batch_normalization_18/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 20.537586212158203, "scale": 0.7430611853506051, "dtype": "uint8"}}, {"name": "batch_normalization_2/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.35411226749420166, "scale": 0.004951916021459243, "dtype": "uint8"}}, {"name": "batch_normalization_2/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.7736656492831661, "scale": 0.0059058446510165345, "dtype": "uint8"}}, {"name": "batch_normalization_2/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -15.041834603103936, "scale": 0.09520148482977175, "dtype": "uint8"}}, {"name": "batch_normalization_2/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 14.187051773071289, "scale": 0.6245692458807254, "dtype": "uint8"}}, {"name": "batch_normalization_3/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.4445681869983673, "scale": 0.006935059673645917, "dtype": "uint8"}}, {"name": "batch_normalization_3/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -1.7963866191751818, "scale": 0.011020776804755716, "dtype": "uint8"}}, {"name": "batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -1.66757609984454, "scale": 0.012083884781482174, "dtype": "uint8"}}, {"name": "batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.012022861279547215, "scale": 0.015930060278989522, "dtype": "uint8"}}, {"name": "batch_normalization_4/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.25480177998542786, "scale": 0.010276772812301037, "dtype": "uint8"}}, {"name": "batch_normalization_4/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -1.0471849277907725, "scale": 0.00781481289396099, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -2.352887252732819, "scale": 0.01443489112106024, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 1.5760990381240845, "scale": 0.016809382625654633, "dtype": "uint8"}}, {"name": "batch_normalization_5/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.7069435119628906, "scale": 0.0038822786480772727, "dtype": "uint8"}}, {"name": "batch_normalization_5/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.7596850563498104, "scale": 0.006722876604865579, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -3.094459814183852, "scale": 0.023803537032183478, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.2151089310646057, "scale": 0.06883433449502084, "dtype": "uint8"}}, {"name": "batch_normalization_6/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.19954167306423187, "scale": 0.007716374829703687, "dtype": "uint8"}}, {"name": "batch_normalization_6/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -1.4124284388972264, "scale": 0.009292292361165962, "dtype": "uint8"}}, {"name": "batch_normalization_6/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -2.926333573285271, "scale": 0.02032176092559216, "dtype": "uint8"}}, {"name": "batch_normalization_6/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 1.805694818496704, "scale": 0.056178709104949355, "dtype": "uint8"}}, {"name": "batch_normalization_7/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.7981632947921753, "scale": 0.0033678302577897614, "dtype": "uint8"}}, {"name": "batch_normalization_7/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.7169803808717167, "scale": 0.006128037443348006, "dtype": "uint8"}}, {"name": "batch_normalization_7/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -3.7155280861200075, "scale": 0.025448822507671283, "dtype": "uint8"}}, {"name": "batch_normalization_7/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.17934390902519226, "scale": 0.09417504808482002, "dtype": "uint8"}}, {"name": "batch_normalization_8/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.39291277527809143, "scale": 0.007871368235232783, "dtype": "uint8"}}, {"name": "batch_normalization_8/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.5930660285201727, "scale": 0.005930660285201727, "dtype": "uint8"}}, {"name": "batch_normalization_8/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -2.569891699622659, "scale": 0.02649372886208927, "dtype": "uint8"}}, {"name": "batch_normalization_8/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 2.559129476547241, "scale": 0.028920664506800035, "dtype": "uint8"}}, {"name": "batch_normalization_9/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.6833438873291016, "scale": 0.003927369678721708, "dtype": "uint8"}}, {"name": "batch_normalization_9/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.2918998774360208, "scale": 0.005307270498836742, "dtype": "uint8"}}, {"name": "batch_normalization_9/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -0.9336615450241987, "scale": 0.007182011884801528, "dtype": "uint8"}}, {"name": "batch_normalization_9/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.16518917679786682, "scale": 0.025300043120103723, "dtype": "uint8"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32", "quantization": {"min": -1.8940385252821679, "scale": 0.012219603388917212, "dtype": "uint8"}}, {"name": "conv2d_10/kernel", "shape": [1, 1, 64, 18], "dtype": "float32", "quantization": {"min": -3.1564841550939224, "scale": 0.026304034625782687, "dtype": "uint8"}}, {"name": "conv2d_10/bias", "shape": [18], "dtype": "float32", "quantization": {"min": -1.0239238374373492, "scale": 0.018961552545136096, "dtype": "uint8"}}, {"name": "conv2d_11/kernel", "shape": [1, 1, 32, 32], "dtype": "float32", "quantization": {"min": -1.561957456551346, "scale": 0.012802929971732345, "dtype": "uint8"}}, {"name": "conv2d_12/kernel", "shape": [1, 1, 64, 32], "dtype": "float32", "quantization": {"min": -3.0632504332299324, "scale": 0.020152963376512713, "dtype": "uint8"}}, {"name": "conv2d_13/kernel", "shape": [1, 1, 32, 18], "dtype": "float32", "quantization": {"min": -3.3228876908620197, "scale": 0.027923425973630418, "dtype": "uint8"}}, {"name": "conv2d_13/bias", "shape": [18], "dtype": "float32", "quantization": {"min": -2.451337053261551, "scale": 0.020258983911252488, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"min": -1.7778957240721758, "scale": 0.016932340229258817, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [1, 1, 32, 32], "dtype": "float32", "quantization": {"min": -1.8026498149423038, "scale": 0.014194093031041763, "dtype": "uint8"}}, {"name": "conv2d_4/kernel", "shape": [1, 1, 32, 32], "dtype": "float32", "quantization": {"min": -1.5456362471860996, "scale": 0.012669149567099178, "dtype": "uint8"}}, {"name": "conv2d_5/kernel", "shape": [1, 1, 32, 32], "dtype": "float32", "quantization": {"min": -1.3983513523550595, "scale": 0.010132980814167098, "dtype": "uint8"}}, {"name": "conv2d_6/kernel", "shape": [1, 1, 32, 64], "dtype": "float32", "quantization": {"min": -1.647898370144414, "scale": 0.012676141308803185, "dtype": "uint8"}}, {"name": "conv2d_7/kernel", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"min": -1.4243262440550561, "scale": 0.012070561390297085, "dtype": "uint8"}}, {"name": "conv2d_8/kernel", "shape": [1, 1, 128, 32], "dtype": "float32", "quantization": {"min": -1.856558523458593, "scale": 0.013959086642545812, "dtype": "uint8"}}, {"name": "conv2d_9/kernel", "shape": [1, 1, 32, 64], "dtype": "float32", "quantization": {"min": -1.6769418099347284, "scale": 0.014710015876620424, "dtype": "uint8"}}, {"name": "depthwise_conv2d_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -0.950925645641252, "scale": 0.010116230272779277, "dtype": "uint8"}}, {"name": "depthwise_conv2d_2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -1.1554854131212422, "scale": 0.00931843075097776, "dtype": "uint8"}}, {"name": "depthwise_conv2d_3/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -0.8017079914317411, "scale": 0.007032526240629308, "dtype": "uint8"}}, {"name": "depthwise_conv2d_4/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -1.6910236583036533, "scale": 0.010568897864397834, "dtype": "uint8"}}, {"name": "depthwise_conv2d_5/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"min": -1.4623411318835091, "scale": 0.012392721456639907, "dtype": "uint8"}}, {"name": "depthwise_conv2d_6/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -1.2739428104138841, "scale": 0.009578517371532964, "dtype": "uint8"}}, {"name": "depthwise_conv2d_7/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"min": -1.5533865521935855, "scale": 0.012041756218554927, "dtype": "uint8"}}]}]}